//######################################################################
//###########################           SSTech       ###################
//###########################   Programming Courses  ###################
//###############################################################
let nun1, nun2, result: number;

nun1 = parseInt(prompt(' يا ياسين ادخل العدد الذي تريده '));
nun2 = parseInt(prompt('يا ياسين من فضلك ادخل العدد الذي تريده '));
result = nun1 + nun2;

if (result < 0) {
  console.log('ضرب العددين سالب ');
} else {
  console.log('العدد موجب ');
}
