//######################################################################
//###########################           SSTech       ###################
//###########################   Programming Courses  ###################
//###############################################################
let nun1, nun2, result: number;

nun1 = parseInt(prompt('ادخل اعدد'));
nun2 = parseInt(prompt('ادخل اعدد من فضلك '));
result = nun1 + nun2;
if(result==0){console.log("العدد منعدم")};
if (result < 0) {
  console.log('االعدد سالب ');
} else {
  console.log('العدد موجب');
}
